#+TITLE:     Knowledgebase
#+AUTHOR:    Peter Friedrich
#+SETUPFILE: _static/css/theme-readtheorg.setup


* Unix Tools
  Snippets für einige grundlegende Unixtools

** =awk=
   Textprocessing

   #+NAME: namenstabelle
   : 1)  Amit    Physics  80
   : 2)  Rahul   Maths    90
   : 3)  Shyam   Biology  87
   : 4)  Kedar   English  85
   : 5)  Hari    History  89

   #+BEGIN_SRC awk :stdin namenstabelle :results output :exports all
   {print $2}
   #+END_SRC

   #+RESULTS:
   : Amit
   : Rahul
   : Shyam
   : Kedar
   : Hari

** =sed=
   #+BEGIN_SRC shell :stdin namenstabelle :results output :exports all
   sed "s/)/(/"
   #+END_SRC

   #+RESULTS:
   : 1(  Amit    Physics  80
   : 2(  Rahul   Maths    90
   : 3(  Shyam   Biology  87
   : 4(  Kedar   English  85
   : 5(  Hari    History  89

* Orgmode
 
** Org Babel
   Weitergabe von Blöcken als Input in andere Blöcke:
   - Plaintext, z.B. für [[=awk=]]
